{
  "architectures": [
    "PhiMoEForCausalLM"
  ],
  "attention_dropout": 0.0,
  "bos_token_id": 1,
  "eos_token_id": 2,
  "hidden_act": "silu",
  "hidden_size": 4096,
  "initializer_range": 0.02,
  "intermediate_size": 6400,
  "max_position_embeddings": 4096,
  "model_type": "mixtral",
  "num_attention_heads": 32,
  "num_experts_per_tok": 2,
  "num_hidden_layers": 32,
  "num_key_value_heads": 8,
  "num_local_experts": 16,
  "output_router_logits": false,
  "rms_norm_eps": 1e-05,
  "rope_theta": 10000.0,
  "router_aux_loss_coef": 0.0003,
  "sliding_window": 2048,
  "attention_bias": true,
  "lm_head_bias": true,
  "tie_word_embeddings": false,
  "torch_dtype": "bfloat16",
  "transformers_version": "4.36.0.dev0",
  "use_cache": true,
  "vocab_size": 32064,
  "_attn_implementation": "flash_attention_2",
  "auto_map": {
    "AutoConfig": "configuration_mixtral.MixtralConfig",
    "AutoModelForCausalLM": "modeling_mixtral.MixtralForCausalLM"
  }
}
